# პირველი კაჰუტი

#1 რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომეტრიული ფიგურების ასაგებად? Turtle
#2  რომელ ფუნქციას ვიყენებთ, როდესაც გვინდა, რომ terninal-ში მოვახდინოტ დაბეჭდვა? print ფუნქციას
#3 პითონის გამოყენებით შეუძლებელია ალგორითმების შექმნა
#4 ათწილადებზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ? float-ს
#5 რომელია პითონისთვის სწორი კომენტარი? hashtag -#
#6  რომელ ფუნქციას ვიყენებთ მომხმარებლისგან terminal-იდან ტექსტის მისაღებად? input ფუნქციას
#7 input-იდან მიღებული ინფორმაცია ინახება სტრინგ-ის სახით? სიმართლეა
#8 როგორ ვამოწმებთ მონაცემთა ტიპს? type(x) type ფუნქციის საშუალებით
#9 რომელი ცვლადი ინახავს ათწილადს? x = 10/2 რადგან გაყოფის მერე მიიღება float-ი 
#10 რომელ ვარიანტშია პითონის ცვლადი სწორად შექმნილი? x = 12
#11  რას გამოიტანს კოდი? error რადგან int-ს კრებდა str-თან
#12  რას გამოიტანს კოდი? 1020 რადგან int-ები გადაიყვანა str-ში და შეკრიბა
#13 რას გამოიტანს კოდი, როდესაც მომხმარებელი შეიყვანს 7-ს? class"float" რადგან 7ის type არის დაპრინტული
#14 რა დაიპრინტება True or False? 
#x = ((True and False)) or ((False or False))
#y = ((False or True)) and ((False and True))
#print((x and y) or True)  True.
#15 რას გამოიტანს კოდი, როდესაც მომხმარებელი შაიყვანს 20-ს?
#age = int(input("your age: "))
#print(age > 18) True რადგან თუ 18-ზე მეტია შეყვანილი ასაკი მაშინ უნდა დაპრინტოს კი ანუ True