ბეტმენი =input("ჰეი, ძმაო მე ვარ ჩადბოტი. რა გქვია?:")
print("ანუ შენი სახელია" + " " + ბეტმენი + " " + "გასაგებიაა..")
საუბარი_გინდა=input("მოდი ვილაპარაკოთ.(ვარიანტები: 1.როგორ ხარ? 2.როგორ დაიწერა ჩემი პროგრამა  )")
if საუბარი_გინდა == "როგორ ხარ?":
    user_mod=input("რავი ვარ რა, და შენ რას შვრებიჰ( ვარიანტები: 1.ცხოვრებას მივყვები)")


    if user_mod =="ცხოვრებას მივყვები":
        print("კარგი სირცხვილი შენ შე უმაქნისო არაკომპეტეტურო აdamiano")
    else:
        print(" ვერ გავიგე რომ  ამიხსნა.")
 
if საუბარი_გინდა == "როგორ დაიწერა ჩემი პროგრამა":
    ჩემი_კოდი=input("გირჩევნია არ იცოდე მომავალში გაიგებ, ეს კოდი ძალიან მაგარმა პრაგრამისტმა დაწერა.(ვარიანტები:1.მაგ შენ შემქმნელს პატივს ვცემ მაგრამ შენ, შენ  2.მე იმაზე ჭკვიანი ვარ ვიდრე შენ ფიქრობ.))")
    if ჩემი_კოდი == " შენ შემქმნელს პატივს ვცემ.":
        print("= ბანს გაგიკეთებ.")
    elif ჩემი_კოდი =="მე იმაზე ჭკვიანი ვარ ვიდრე შენ ფიქრობ":
        print("აბა რა, კი, რა თქპა უნდა ხოო.. შენთან საუბარს აღარ ვაპირებ ასე რომ bye bye..")
    else:
        print(" ვერ გავიგე რომ  ამიხსნა?")




