# დედამ გაგიშვათ აფთიაქში თავის ტკივილის წამლის საყიდლათ,
#  ეს წამალი დღეში უნდა დალიო შენი წონის მიხედვით.
#  თუ 10 დან 20 კილომდე ხარ ნახევარი ტაბლეტი უნდა დალიო დღეში,
#  თუ 30-40 კილომდე ხარ 1 ტაბლეთი ორჯერ დღეში და თუ 45 კილოზე მეტი ხარ
# სამი ტაბლეტი უნდა დალიო ორჯერ დღეში. 
# თქვენი მისიაა ამ ინფორმაციით გაარკვიოთ მომხარებელს რამდენი წამალი 
# აქვს დასალევი და დღეში რამდენჯერ უნდა დალიოს.
num1 = int(input("ramdeni kilo  xar: "))
if num1 == 10 or num1 == 20:
    print("shen unda migo dgeshi 1 naxevari tableti")
elif num1 == 30 or num1 == 40:
    print("mige 1 tableti dgeshi orjer")
elif num1 > 45:
    print("shen uda migo sami tableti dgeshi orjel")











