def function(par1, par2):
    sum = par1 + par2
    print(sum)
function(20,123)
function(1351,3241)
function(32432,4142335)
function(1,1)
function(325,14312)
#ფუნქცია  არის კოდის ბლოკი, რომელიც ასრულებს რაღაც დავალებას და შეიძლება
#  გამოძახებულ იყოს ბევრჯერ პროგრამის სხვადასხვა ადგილიდან.
#ასევე ვიყენებთ იმისთვის რომ კოდი ბევრჯერ არ ვწეროთ და ადვილად და ერთხელ გამოვიძახოთ
#ფუნქციები გვეხმარება კოდის კოხტად წერაში, გამარტივებაში, ბევრჯერ გამოყენებაში და ადვილად გასარკვევს ხდის კოდს, რითაც ამცირებს გამეორებებს და აადვილებს პროგრამირების დაწერას.