#key frames არის ისეთი რამ რაც გვეხმარება გავხადოთ რამემ იმოძრაოს ჩვენი შეხების გარეშე ვებსაიტზე animation ის დახმარებით.
#ანიმაცია არის ისეთი რამ რაც გვეხმარება შევქმნათ რაღაცის ანიმაცია და მერე გავხადოთ მოძრავი  key-frame ის დახმარებით
#animation-name  არის ანიმაციის სახელი
#animation-duration  არის ანიმაციის ხანგძლივობა.
#animation-delay  არის ვებსაიტის ჩატვირთვის მერე რამდენ ხანში უნდა დაიწყოს ანიმაციის მიმთითებელი.
#animation-iteration-count  ანიმაცია რამდენჯერ უნდა შესრულდეს
#animation-direction ანიმაციის მიმართულების მიმთითებელი.
#animation-timing-function  ეს განსაზღვრავს ანიმაციის დროის ფუნქციას.