
#1 ) მომხმარებელს შემოატაინეთ ორი რიცხვი და მათზე მოახდინეთ მათემატიკური ოპერაციები.
#2)მოიყვანეთ 10 მაგალითი შედარების ოპერატორებზე ==,!=,>,<,=<,=>
#3) მომხმარებელს შემოატაინეთ თავისი სახელი, გვარი, ასაკი, და შემდეგ შეაერთეთ ისე რომ გამოვიდეს წინადადება.
#4) ახსენით რა განსხვავება ამათ შორის !=,==,ახსენით კომენტარებით 
#5) მომხმარებელს შემოატაინეთ სახელი, გვარი,ასაკი, საცხოვრებელი ადგილი .
#6) მომხმარებელს შემოატაინეთ 2 რიცხვი, და შემდეგ გამოიყენეთ შედარების ოპერატორები რა რიცხვსაც შეიყვანს მომხმარებელი,
#  მასე გამოიყენთ შედარების ოპერატორები ==,!=,<,>,<=,=>.
