login = int(input("მოგესალმებით თუ გინდათ დარეგისტრირდეთ დაწექით დაწექი 1  და თუ გინდა გამოხვიდე დაწერე ნებისმიერი სხვა რიცხვი|"))
if login == 1:
    a = (input("შეყვანე შენი სახელი "))
    K = (input("შეიყვანეთ თქვენი პაროლი "))
elif login !=1:
    print("მადლობა რო ისარგებლეთ გოას ბანკით")
print("თქვენ დარეგისტრირდით")
print("მოგესალმებით გოას ბანკში" + a)

start = int(input("|1|========>გაქტიურო ინტერნეტი  |2|========>გაქტიურო დასარეკი |3|========>ანგარიშის გახსნა |4|========>სესხის აღება  |5|========>განვადების აღება"))

def number1():
    if start == 1:
        j = (input("შეიყვანეტ თქვენი პირდაი ნომერი რათა გაქტიურო ინტერნეტი :"))
        print("........................")
        if len(j) == 11:
            print("თქვენ გაიაქტიურდათ ინტერნეტი :")
            print("........................")
        else:
            print("პირადი ნომერი არასწორია :")
            print("........................")

def number2():
    if start == 2:
        p = input("შეიტანე შენი პირადი ნომერი :")
        print("........................")
        if len(p) == 11:
            print("თქვენ შეიყვანეთთ თქვენი პირადი ნომერი სწორად :")
            print("........................")
        else:
            print("თქქვენ არასწორად შეიყვანეთ თქვენი პირადი ნომერი :")
            print("........................")
        n = input("შეიყვანე შენი თელეფონის ნომერი :")
        print("........................")
        if len(n) == 8 or 10:
            print("თქვენ გაქტიურეთ დასარეკი :")
            print("........................")
        else:
            print("თქვენ ვერ გაქტიურეთ დასარეკი :")
            print("........................")

def number3():
    if start == 3:
        j = int(input("თუ თქვენ გსურთ ანგარიშის გახსნა აირჩიეთ ნომერი |1| ===> +995 599 235 431|2| ====>+995 599 764 839|3| ======>+995 599 493 403|"))
        if j == 1:
                print("თქვენ აიირჩიეთ 1 ვარიანტი თქვენი ნომერია-|+995 599 235 431|")
                print("........................")
        elif j == 2:
            print("თქვენ აირჩიეთ #2 ვარიანტი თქვენი ნომერია-|+995 599 764 839|")
            print("........................")
        elif j == 3:
            print("თქვენ აირჩიეთ #3 ვარიანტი თქვენი ნომერია |+995 599 493 403|")
            print("........................")

def number4():
    if start == 4:
        print("-- sesxis ageba --- ")

        print("........................")


        print("1) იმპოტექური სესხი :")
        print("........................")
        print("2) სამომხმარებლო სესხი :")
        print("........................")
        print("3) ავტო სესხი :")
        print("........................")

        print("     ")

        print("სესხის ლიმიტი არი 1000000₾")

        print("..........................")


        sesxi = input("რა სახლის ტიპის სესხი აგება გსურთ: ")
        print("........................")
        sesxis_vada = input("რამდენი ხნით გსურთ სესხის აგება: ")
        print("........................")
        shemosavali = float(input("შეიყვანეთ თქვენი თვიური შემოსავალი: "))
        print("........................")
        tanxa = float(input("რა  თანხის აგება გსურთ: "))
        print("........................")


        if sesxi == "1":
            if shemosavali <= 1000 and tanxa <= 10000:
                print("გილოცავტ,თქვენ დაგიმთკიცდატ სესხი")
                print("........................")
            elif shemosavali <=10000 and tanxa <=100000:
                print("გილოცავტ,თქვენ დაგიმტციცდატ სესხი")
                print("........................")
            elif shemosavali <=100000 and tanxa < 1000000:
                print("გილოცავთ,თქვენ დაფიმტციცდათ სესხი")
                print("........................")
            else:
                print("ამწუხაროთ სესხი ვერ დაგიმტკიცდათ")
                print("........................")

        elif sesxi =="2":
            if shemosavali <= 1000 and tanxa <= 10000:
                print("გილოცავთ,თქვენ დაგიმტკიცდათ სესხი")
                print("........................")
            elif shemosavali <=10000 and tanxa <=100000:
                print("გილოცავთ,თქვენ დაგიმტკიცდათ, სესხი")
                print("........................")
            elif shemosavali <=100000 and tanxa < 1000000:
                print("გილოცავთ,ტქცენ დაგიმტკიცდათ სესხი")
                print("........................")
            else:
                print("სამწუხაროთ სესხი ვერ დამტკიცდა")
                print("........................")

        elif sesxi =="3":
            if shemosavali <= 1000 and tanxa <= 10000:
                print("გილოცავთ,თქვენ დაგიმტკიცდათ სესხი")
                print("........................")
            elif shemosavali <=10000 and tanxa <=100000:
                print("გილოცავთ,თქვენ დაგიმტკიცდათ სესხი")
                print("........................")
            elif shemosavali <=100000 and tanxa < 1000000:
                print("გილოცავთ,ტქვენ დაგიმტკიცდათ სესხი")
                print("........................")
            else:
                print("სამწუხაროთ სესხი ბერ ვერ დაგიმტკიცდათ")
                print("........................")

def number5():
    if start == 5:
        print("გამარჯობათ თქვენ გსურთ გოას ბანკში განვადების აღება ჩვენთან არის წლიური 10%")
        print("........................")
        tanxa = float(input("რამდენი ლარის განვადება გჭირდებათ შეიყვანეთ ლარში :"))
        print("........................")
        procenti = 10
        tveebi = int(input("შეიყვანეთ რამდენი თვით გინდათ განვადების გაკეთება :"))
        print("........................")

        tve = (procenti / 100)/12

        if tveebi > 0:
            gadasaxadi = (tanxa * tve) / (1 - (1 + tve) ** -tveebi)
            print(f"თქვენი ყოველთვიური გადასახადი იქნება: {round(gadasaxadi)} ლარი")
            print("........................")
        else:
            print("გთხოვთ, შეიყვანოთ სწორი თვეთა რაოდენობა.")

number1()
number2()
number3()
number4()
number5()



# შემქმნელები(ალექსანდრე კეკოშვილი),(ბექა ვარდუკაძე),(ლუკა გოგიშვილი)